package tech.ai_robotics.drone_shooter_2.object_detection

/**
 * @author ivan.klymenko@fuib.com on 30/01/2025
 */
//левый верх
//0 BoundingBox(x1=0.055731162, y1=0.01798682, x2=0.15635231, y2=0.08204384, cx=0.10604174, cy=0.05001533, w=0.10062115, h=0.06405702, cnf=0.8650919, cls=0, clsName=carsv4)
//top = 17.267345
//left = 40.12644, right = 112.57366
//bottom = 78.762085

//правый верх
//0 BoundingBox(x1=0.84900963, y1=0.056706727, x2=0.91956437, y2=0.09935489, cx=0.884287, cy=0.07803081, w=0.07055467, h=0.042648166, cnf=0.85618234, cls=0, clsName=carsv4)
//top = 54.438457
//left = 611.2869, right = 662.08636
//bottom = 95.3807

//правый низ
//0 BoundingBox(x1=0.84797454, y1=0.8987696, x2=0.9359324, y2=0.95783067, cx=0.89195347, cy=0.92830014, w=0.0879578, h=0.05906099, cnf=0.7564554, cls=0, clsName=carsv4)
//top = 862.81885
//left = 610.5417, right = 673.87134
//bottom = 919.51746

//левый низ
//0 BoundingBox(x1=0.04957406, y1=0.91004086, x2=0.11370821, y2=0.9667449, cx=0.08164114, cy=0.9383929, w=0.06413416, h=0.056703985, cnf=0.8625954, cls=0, clsName=carsv4)
//top = 873.6392
//left = 35.69332, right = 81.86991
//bottom = 928.0751

//центр
//0 BoundingBox(x1=0.4890222, y1=0.4453364, x2=0.54914314, y2=0.48529118, cx=0.51908267, cy=0.4653138, w=0.06012094, h=0.03995481, cnf=0.8729553, cls=0, clsName=carsv4)
//top = 427.52295
//left = 352.09598, right = 395.38306
//bottom = 465.87955